{
  "meta": {
    "title": "سورھ البقرہ (گائے)",
    "subtitle": "مدنی سورھ۔40 رکوع۔286 آیات۔",
    "description": "سورھ البقرہ کا مختصر خلاصہ اور فوائد"
  },
  "chapters": [
    {
      "id": "ruku-1",
      "title": "رکوع نمبر 1",
      "subtitle": "Ruku 1",
      "icon": "BookOpen",
      "order": 1,
      "sections": [
        {
          "id": "ruku-1-main",
          "title": "متقین کی صفات اور انعامات",
          "subtitle": "Qualities & Rewards of the Righteous",
          "content": [
            "سب سے پہلے ارشاد فرمایا اس کتاب(مبارک )میں کوئی شک نہیں اللہ تعالٰی کی طرف سے ھے اور اس کا ہر حکم واقعات، انجام، جنت، دوزخ غرض ایک ایک حرف حق ھے  شک و شبہ سے بالاتر ہے۔",
            "اللہ تعالٰی نے ان لوگوں کو جو غیب پر ایمان رکھتے, نماز قائم کرتے۔اللہ کی راہ میں خرچ کرتے, قرآن مجید,  سابقہ آسمانی کتابوں ۔,صحیفوں اور آخرت پر ایمان رکھتے ہیں انہیں ھدایت یافتہ اور کامیاب قرار دیا ہے۔",
            "جبکہ اس سے کفر اور انکار کرنے والوں پر ان کی روش کی وجہ سے دلوں آنکھوں اور کانوں پر اللہ تعالٰی نے مہر کردی اور ان کو نصیحت کرنا یا نہ کرنا برابرھے۔ "
          ],
          "notes": ["یہ لوگ دنیا کی زندگی کو ہی حقیقت مان بیٹھے جبکہ نبی کریم نے دینا کی زندگی کو مسافر بن کر گزارنے کا کہا ھے۔لہذا ہم سوچیں کہ ہم اپنی زندگی میں اللہ اور اس کے رسول کے احکامات پر کتنا عمل پیرا ہیں۔"],
          "images": [
            "https://pakweb.net/wp-content/uploads/2024/03/Surah-Al-Baqarah-images-1-scaled-e1724320134286.jpg",
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771330876/Surah-Al-Baqarah-images-2-scaled-e1724059899746_-_Copy_kwou9c.jpg"
          ]
        }
      ]
    },
    {
      "id": "ruku-2",
      "title": "رکوع نمبر 2",
      "subtitle": "Ruku 2",
      "icon": "BookOpen",
      "order": 2,
      "sections": [
        {
          "id": "ruku-2-main",
          "title": "منافقین کی نشانیاں اور انجام",
          "subtitle": "Signs and End of Hypocrites",
          "content": [
            "منافقین(متقین اور کافروں کے بعد تیسرا گروہ ) کی نشانیاں اور انجام۔",
            "یہ لوگ مسلمانوں کو دھوکہ اور چکمہ دینے کے لئے خود کو ایمان والے کہتے ہیں مگر  وہ ایمان نہیں رکھتے اور وہ اللہ تعالٰی اور اھل ایمان کی بجائے اپنے آپ کو دھوکہ دیتے ہیں۔ان میں منافقت کا مرض یے اور اس رویہ کی وجہ سے انہیں دکھ دینے والا عذاب ھو گا۔",
        "نبی کریم صلی اللہ علیہ والہ وسلم کی کامل رحمت کے باوجود یہ لوگ اندھیرے میں رہے جس کی وجہ سے قریب ہے اللہ تعالٰی  ان کی بینائی ختم کر دے لہزا اس تجارت نے انہیں کوئی نفع نہ دیا یہ گروہ کافروں سے بھی خطرناک ھے جبکہ صحابہ کرام کے ایمان کو معیار قرار دیا گیا ہے۔"
          ],
          "notes": ["منافقین اپنی اس زندگی کے عارضی  فائدوں کو ہی سب کچھ سمجھتے ہیں اور اپنی خواہشات کو اللہ تعالیٰ اور رسول کے احکامات پر ترجیح دیتے ہیں"],
          "images": [
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771330877/Surah-Al-Baqarah-images-2-scaled-e1724059899746_mgxzbq.jpg",
            "https://pakweb.net/wp-content/uploads/2024/03/Surah-Al-Baqarah-images-3-scaled-e1724060016554.jpg",
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771330992/2nd_ueslgy.jpg"
          ]
        }
      ]
    },
    {
      "id": "ruku-3",
      "title": "رکوع نمبر 3",
      "subtitle": "Ruku 3",
      "icon": "BookOpen",
      "order": 3,
      "sections": [
        {
          "id": "ruku-3-main",
          "title": "اللہ کے خالق و مالک ھونے پر یقین",
          "subtitle": "Belief in Allah as Creator and Owner",
          "content": [
            "اس مبارک رکوع میں تمام انسانوں کو مخاطب کر کے کہا گیا کہ اللہ کی عبادت کرو جس نے تمہیں اور تم سے پہلے آنے والے لوگوں کو پیدا کیا ہے۔ اللہ ہی نے تمہارے لیے زمین و آسمان اور مختلف پھل میوے پیدا فرمائے۔ اسمان سے پانی برسایا اور لہذا تم اللہ کے ساتھ کسی کو شریک نہ بناؤ اور چیلنج کیا گیا کہ کہ اگر اس قران کے اللہ تعالیٰ کی طرف سے ہونے پر تمہیں کوئی شک ہے تو اس طرح کی کوئی سورت تم اور ساتھی مل کر بنا لاؤ۔ تم ایسا کر ہی نہیں سکتے۔ اس کے بعد اہل ایمان کو جنت کی خوشخبریاں اور وہاں کے ہم شکل میوے, پاک عورتیں اور ہمیشہ ہمیشہ کی زندگی کا ذکر ہے جبکہ کافروں کے لیے جہنم جس کا ایندھن انسان اور پتھر ہوں گے۔ اور پھر اپنے رشتہ داروں کے ساتھ حسن سلوک، تعلق کو جوڑے رکھنے اور وعدوں کو پورا کرنے کے حکم ہے۔ پھر انسانوں کو مخاطب کیا گیا کہ تمہارا وجود ہی نہیں تھا اس نے تمہیں پیدا کیا زندگی دی وہی تمہیں موت دے گا اور پھر دوبارہ زندہ کرکے تمہارا حساب لے گا۔ اور اس کے بعد اس رکوع میں زمین میں موجود تمام چیزوں اور سات اسمانوں کی پیدائش کا ذکر فرمایا اور بے شک ہر چیز اس کے علم میں ھے۔"
          ],
          "notes": ["لہذا اس میں کوئی شک نہیں کہ اللہ تعالیٰ جو کچھ ھونے والا ھے، ہو رہا ہے اور جو کچھ ھوچکا وہ سب جانتا ہے۔"],
          "images": [
            "https://pakweb.net/wp-content/uploads/2024/03/Surah-Al-Baqarah-images-4-scaled-e1724060529801-1076x1536.jpg",
            "https://pakweb.net/wp-content/uploads/2024/03/Surah-Al-Baqarah-images-5-scaled-e1724060618786-1068x1536.jpg"
          ]
        }
      ]
    },
    {
      "id": "ruku-4",
      "title": "رکوع نمبر 4",
      "subtitle": "Ruku 4",
      "icon": "BookOpen",
      "order": 4,
      "sections": [
        {
          "id": "ruku-4-main",
          "title": "حضرت آدم کی پیدائش",
          "subtitle": "Birth of Hazrat Adam",
          "content": [
            "اس مبارک رکوع میں انسان کی پیدائش کا ذکر ہے اور اسے اپنا خلیفہ قرار دیا ہے۔",
            "جب اللہ تعالی نے فرشتوں سے حضرت ادم علیہ السلام کی پیدائش کا تذکرہ کیا فرشتوں نے کہا کہ ہم تیری حمد وثناء ہر وقت کرتے ہیں جبکہ انسان تو زمین میں فساد کرے گا (کیونکہ انسان سے پہلے زمین میں جنات کو پیدا کیا جو کہ زمین میں فساد کرتے تھے۔) اللہ تعالی نے فرمایا کہ جو میں جانتا ہوں وہ تم نہیں جانتے۔ اس طرح حضرت ادم علیہ السلام کو پیدا کر کے ان کو کچھ علم سکھاۓ اور فرشتوں سے کہا گیا کہ تم ان چیزوں کے نام بتاؤ لیکن انہوں نے کہا کہ ہم صرف اتنا جانتے ہیں جتنا اللہ تعالیٰ نے ہمیں سیکھایا جبکہ ادم علیہ السلام نے بتا دیے۔ پھر اللہ تعالی نے فرشتوں کو حضرت ادم علیہ السلام کو سجدہ کرنے کا حکم دیا تو فرشتوں نے سجدہ کیا مگر ابلیس (جو کہ جنات میں سے تھا) نے تکبر کی وجہ سے انکار کر دیا۔ پھر اللہ تعالی نے حضرت ادم علیہ السلام اور ان کی بیوی کو جنت میں جانے کا حکم دیا اور وہاں کی نعمتوں کو بلا روک ٹوک استعمال کرنے لیکن ایک درخت کے پاس جانے سے منع کیا مگر وہ شیطان کے بہکاوے میں آگۓ۔ اس پر انہوں نے اللہ سے استغفار کیا اور اللہ تعالی نے معاف فرما دیا۔ پھر جنت سے نکل جانے کا حکم دیا اور کہا تمہارے پاس میری ہدایت آۓ گی (اللہ کی کتاب اور انبیاء ) اور جو کوئی اس کے مطابق زندگی گزارے گا وہ غم و فکر سے آزاد ہوگا اور جو انکار کرے گا وہ ہمیشہ دوزخ میں عذاب پائے گا۔"
          ],
          "notes": [],
          "images": [
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771331091/4th_start_m4dm4h.jpg",
            "https://pakweb.net/wp-content/uploads/2024/03/Surah-Al-Baqarah-images-6-scaled-e1724323366908-1065x1536.jpg",
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771331357/4th_End_0.1111_zup5zi.jpg"
          ]
        }
      ]
    },
    {
      "id": "ruku-5",
      "title": "رکوع نمبر 5",
      "subtitle": "Ruku 5",
      "icon": "BookOpen",
      "order": 5,
      "sections": [
        {
          "id": "ruku-5-main",
          "title": "بنی اسرائیل سے خطاب",
          "subtitle": "Address to Bani Israel",
          "content": [
            "حضرت ابراہیم علیہ السلام کے پوتے حضرت یعقوب علیہ السلام کو اسرائیل یعنی اللہ کا بندہ کہا جاتا ہے اور ان کی آل کو بنی اسرائیل کہا جاتا ھے۔ اس رکوع مبارک میں بنی اسرائیل کو مخاطب کیا گیا ہے",
            "یہ لوگ اہل کتاب تھے اللہ تعالی نے ان پر اپنے احسانات کا ذکر فرمایا اور ان کو اپنے اقرار کو پورا کرنے کا حکم دیا یعنی نبی صلی اللہ علیہ والہ وسلم پر  اور قرآن مجید پر ایمان لانے کا حکم نیز یہ کہ قران مجید تمہاری کتابوں کی بھی تصدیق کر رہا ہے اس لیے اس پر ایمان لے اؤ اور اس کے منکر نہ بنو اور نہ ہی میرے حکموں میں تحریف کر کے دنیاوی فائدے حاصل کرو، سچی بات جان بوجھ کر نہ چھپاؤ اور حق اور باطل کو گڈ مڈ نہ کرو۔ نماز پڑھو، زکوۃ دو اور اللہ کے سامنے رکوع کرو۔ (یہود کی نماز میں رکوع نہ تھا)۔ تم دوسروں کو نیکی کی تلقین کرتے ہو اور خود اس پر عمل نہیں کرتے حالانکہ تم اہل کتاب ہو۔ کیا تم میں عقل نہیں۔",
            "اس کے بعد فرمایا کہ تم رنج و تکلیف میں صبر اور نماز سے مدد لیا کرو یہ ہمت کا کام ہے مگر ان لوگوں کے لیے مشکل نہیں جو یقین والے ہیں کہ انہیں اپنے رب سے ملنا اور اسی کی طرف لوٹ کر جانا ہے۔"
          ],
          "notes": [],
          "images": [
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771331253/4th_end_nlooqs.jpg",
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771331436/5th_end_ftxzto.jpg"
          ]
        }
      ]
    },
    {
      "id": "ruku-6",
      "title": "رکوع نمبر 6",
      "subtitle": "Ruku 6",
      "icon": "BookOpen",
      "order": 6,
      "sections": [
        {
          "id": "ruku-6-main",
          "title": "بنی اسرائیل کی نافرمانیاں",
          "subtitle": "Disobedience of Bani Israel",
          "content": [
            "اس رکوع کا آغاز بھی بنی اسرائیل کو مخاطب کرتے ہوئے کہا گیا ہے اے بنی اسرائیل میری نعمتوں کو یاد کرو کہ میں نے تمہیں دوسرے جہان والوں پر فضیلت دی اور وہ وقت یاد کرو (قیامت کا دن) جب کوئی کسی کے کام نہ ائے گا نہ کوئی سفارش یا ہدیہ قبول نہ کیا جائے گا اور یاد کرو جب تمہیں قوم فرعون سے نجات دی کہ وہ تمہارے بیٹوں کو قتل کرتے اور بیٹیوں کو زندہ رہنے دیتے تھے۔ تو اس نے انہیں غرق کر کے تمہیں بچا لیا۔ پھر جب موسی علیہ السلام کو 40 رات کے لیے کوہ طور پر بلایا تو ان کے بعد تم نے اپنی جانوں پر ظلم کرتے ہوئے بچھڑے کی پوجا شروع کر دی۔ اس پر بھی تمہیں معاف کیا (کہ بچھڑے کی پوجا نہ کرنے والے پوجا کرنے والوں کو اپنے ہاتھوں سے قتل کریں)، پھر تم نے ایک عجیب مطالبہ کیا کہ ہم اللہ پر ایمان لانے کے لیے اللہ سبحانہ و تعالی کو اپنی آنکھوں سے دیکھے بغیر ایمان نہ لائیں گے، اس بات پر حضرت موسی تمہیں کوہ طور پر لے گۓ اور ایک جھلک کی کڑک سے تم سب مر گئے، اللہ تعالی نے پھر اپنے کرم سے تمہیں زندہ کر دیا۔",
            "تمہارے لیے من و سلمہ نازل کیا اور تمہارے اوپر بادلوں کا سایہ کیا اور جب تم سے کہا گیا کہ تم اس بستی میں حِطَّةٌ کہتے ہوئے داخل ہو لیکن ان ظالموں نے اس کے خلاف کرتے ہوۓ لفظ کو بدل کر اسکی جگہ اور لفظ کہنا شروع کردیا اور تمہاری ان نافرمانیوں کے سبب آسمانوں سے عذاب نازل کیا گیا۔"
          ],
          "notes": [],
          "images": [
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771466074/6th_Start_aruazt.jpg",
            "https://pakweb.net/wp-content/uploads/2024/03/Surah-Al-Baqarah-images-9-scaled-e1724323565400-1024x1536.jpg",
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771466206/6th_End_ptmjsc.jpg"
          ]
        }
      ]
    },
    {
      "id": "ruku-7",
      "title": "رکوع نمبر 7",
      "subtitle": "Ruku 7",
      "icon": "BookOpen",
      "order": 7,
      "sections": [
        {
          "id": "ruku-7-main",
          "title": "اللہ تعالی سے پانی کی درخواست",
          "subtitle": "Request for Water from Allah",
          "content": [
            "اس رکوع مبارک میں حضرت موسی علیہ السلام نے اپنی قوم کے مطالبے پر اللہ تعالی سے پانی مانگا تو حکم ہوا کہ اپنی لاٹھی کو پتھر پر مارو تو اس سے 12 چشمے پھوٹ پڑے، پھر ہر گروہ نے ایک ایک چشمہ اپنے لیے مخصوص کر لیا۔ تو اللہ تعالی نے فرمایا کہ من و سلوی کھاؤ اور یہ پانی پیو اور زمین میں فساد نہ مچاؤ۔ پھر تم نے  حضرت موسیٰ سے کہا کہ ہمیں ایک ہی کھانے پر قناعت (صبر) نہیں۔ آپ ہمارے لیے اللہ تعالی سے زمین سے اگنے والی ترکاری، سبزیاں، پیاز اور مسور وغیرہ مانگیں۔ اس پر حضرت موسی نے کہا کہ تم اعلیٰ چیزیں چھوڑ کر ادنی مانگتے ہو لیکن اگر ایسا ہی چاہتے ہو تو اس شہر میں اتر جاؤ تمہیں وہ چیزیں مل جائیں گی۔",
            "اور اخر کار ان پر ذلت اور رسوائی چسپاں کر دی گئی اور اللہ تعالی کی ایتوں سے انکار، انبیاء کو ناحق شہید کرنے، حد سے بڑھنے اور اللہ تعالیٰ کی نشانیوں کو جھٹلانے کی وجہ سے وہ اللہ کے غضب میں گرفتار ہوئے۔"
          ],
          "notes": [],
          "images": [
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771466207/7th_Start_son47d.jpg",
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771466319/7th_End_u4tzs4.jpg"
          ]
        }
      ]
    },
    {
      "id": "ruku-8",
      "title": "رکوع نمبر 8",
      "subtitle": "Ruku 8",
      "icon": "BookOpen",
      "order": 8,
      "sections": [
        {
          "id": "ruku-8-main",
          "title": "گائے کا واقعہ",
          "subtitle": "The Incident of the Cow",
          "content": [
            "اس رکوع مبارک میں فرمایا گیا کہ کوئی مسلمان، یہودی، عیسائی یا ستارہ پرست جو بھی ہو اگر وہ اللہ کے حکموں کو مانے گا اور نیک اعمال کرے گا وہی اللہ کی رضا حاصل کرے گا۔",
            "پھر جب ہفتے کے دن ان کے لیے مچھلی کا شکار منع کر دیا گیا۔تو اس پر بھی حکم  کی خلاف ورزی کرتے ہوئے تم نے بہانہ ڈھونڈ لیا کہ انہوں نے سمندر کے کنارے تالاب بنائے تاکہ ہفتے کو مچھلیاں ان میں قید ہو جائیں اور وہ انہیں اتوار کو پکڑ سکیں، جس پر سزا اور عبرت کے طور پر انہیں ذلیل و خوار بندر بنا دیا۔",
            "پھر موسی علیہ السلام نے اللہ کے حکم سے اپنی قوم کو ایک گائے ذبح کرنے کا حکم دیا تو اس پر انہوں نے بہانے بناتے ہوۓ اس کے اوصاف کے بارے میں سوالات شروع کردیے تو حضرت موسیٰ علیہ السلام نے اللہ کے حکم سے انہیں بتایا کہ وہ گائے نہ تو بوڑھی ہو اور نہ ہی بالکل کم عمر بچھیا، بلکہ درمیانی عمر کی جوان گائے ہو۔ جب انہوں نے مزید ضد کی اور رنگ کے بارے میں پوچھا تو آپؑ نے فرمایا کہ اس کا رنگ گہرا زرد (سنہرا) ہو جو دیکھنے والوں کی آنکھوں کو بھالا لگے۔ ان کی حجت بازی یہاں بھی ختم نہ ہوئی اور انہوں نے گائے کی مزید تفصیل مانگی، جس پر حضرت موسیٰ علیہ السلام نے واضح کیا کہ وہ ایسی گائے ہو جس سے کبھی محنت کا کام نہ لیا گیا ہو، یعنی نہ اس نے زمین جوتی ہو اور نہ کھیتوں کو پانی دیا ہو، وہ بالکل تندرست اور بے داغ ہو۔ اتنی کڑی شرائط کے بعد وہ بمشکل ایسی گائے تلاش کر پائے اور اسے ذبح کیا، جبکہ وہ ایسا کرتے معلوم نہیں ہوتے تھے۔"
          ],
          "notes": [],
          "images": [
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771466320/8th_Start_a8mpfb.jpg",
            "https://pakweb.net/wp-content/uploads/2024/03/Surah-Al-Baqarah-images-12-scaled-e1724323770383-1060x1536.jpg"
          ]
        }
      ]
    },
    {
      "id": "ruku-9",
      "title": "رکوع نمبر 9",
      "subtitle": "Ruku 9",
      "icon": "BookOpen",
      "order": 9,
      "sections": [
        {
          "id": "ruku-9-main",
          "title": "قاتل کی نشاندہی",
          "subtitle": "Identification of the Murderer",
          "content": [
            "اس رکوع مبارک کے شروع میں جب بنی اسرائیل کا ایک شخص قتل ہو گیا تو وہ اپس میں قاتل کے بارے میں جھگڑنے لگے۔ پھر انہوں نے حضرت موسی سے قاتل کے بارے میں پوچھا تو اللہ کے حکم سے انہوں نے کہا کہ جو گائے ذبح کی گئی تھی اس کا ایک ٹکڑا مردے کو لگاؤ جس پر اللہ تعالی نے مردے کو زندہ کر دیا اور اس نے اپنے قاتل کی نشاندہی کی اور اسی طرح اللہ تعالی مردوں کو زندہ کر دے گا۔",
            "پھر ارشاد ہوا کہ اس کے بعد تمہارے دل پتھر یا اس سے بھی زیادہ سخت ہو گئے، پتھروں میں بھی بعض اللہ کے خوف کے باعث ان میں سے چشمے پھوٹ پڑتے ہیں بعض پھٹ جاتے ہیں اور بعض گر پڑتے ہیں۔ ( مفسرین نے اس سے یہ مطلب بھی لیا ہے کہ انسان کی انکھوں میں اللہ کے خوف سے انسو بہیں یا کم سے کم انکھیں نم ہو جائیں یا پھر وہ اللہ تعالیٰ کے سامنے سجدے میں گر پڑیں۔ )",
            "اس کے بعد یہودیوں کو کہا گیا کہ وہ اللہ کے حکموں کو دنیاوی فائدوں کے لیے نہ بدلیں اور اسے اپنے ہاتھ سے لکھ کر اللہ تعالی کی طرف منسوب نہ کریں لہذا اس سودے سے انہوں نے اللہ کا عزاب خریدا۔",
            "اس کے بعد یہودیوں کے اس عقیدے کی نفی کی گئی کہ وہ صرف چند دن جہنم میں رہیں گے اور اس کے بعد وہ ہمیشہ جنت میں چلے جائیں گے تو فرمایا گیا کہ کیا تمہارا اللہ سے اس بارے میں کوئی وعدہ ہے اللہ تو اپنے وعدے کی خلاف نہیں کرتا بلکہ جو کوئی کفر اور شرک کرے گا وہ جہنمی ہے اور ہمیشہ اس میں ہوگا جبکہ اہل ایمان اور نیک کام کرنے والے ہمیشہ جنت میں رہنے والے ہیں۔"
          ],
          "notes": [],
          "images": [
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771466419/9th_Start_aopjuw.jpg",
            "https://pakweb.net/wp-content/uploads/2024/03/Surah-Al-Baqarah-images-13-scaled-e1724323837555-1040x1536.jpg",
            "https://res.cloudinary.com/dkhv1yqda/image/upload/v1771466501/9th_end_yyvol3.jpg"
          ]
        }
      ]
    }
  ]
}