{
  "meta": {
    "title": "سورة الفاتحہ",
    "subtitle": "مختصر خلاصہ",
    "description": "سورة الفاتحہ کا تعارف، فضیلت اور خلاصہ"
  },
  "chapters": [
    {
      "id": "surah-fatiha-importance",
      "title": "سورة الفاتحہ مختصر فضائل",
      "subtitle": "Importance of Surah Al-Fatiha",
      "icon": "BookOpen",
      "order": 1,
      "sections": [
        {
          "id": "introduction",
          "title": "تعارف",
          "subtitle": "Introduction",
          "content": [
            "سورہ فاتحہ ترتیب کے لحاظ سے قران مجید کی پہلی سورت ہے۔ یہ سورہ مکیہ ہے اور اس میں سات آیات ہیں۔",
            "اسے سورت اساس القران سبع مسانی اور سورت الشفاء بھی کہا جاتا ہے۔ حدیث قدسی ہے اللہ تعالی نے اس سورہ کو اپنے اور بندے کے درمیان ادھا ادھا بانٹ دیا ہے۔ ہم ہر نماز کی ہر رکعت میں اس کی تلاوت کرتے ہیں۔"
          ],
          "notes": []
        },
        {
          "id": "incident-of-sahaba",
          "title": "صحابہ کا واقعہ",
          "subtitle": "Incident of the Companions",
          "content": [
            "ایک مرتبہ صحابہ کی ایک جماعت سفر میں تھی ایک بستی سے گزرے تو وہاں کے لوگوں سے کھانے کے لیے کچھ مانگا۔ مگر انہوں نے انکار کر دیا تو صحابہ نے گاؤں کے باہر ہی ڈیرہ ڈال دیا۔",
            "رات کو ان کے سردار کو کسی جانور نے ڈس لیا تو وہاں سے ایک ادمی ان کے پاس ایا کہ اپ نے کوئی اس کا علاج کرنے والا ہو۔ تو صحابہ کرام نے ان سے 30 سے زائد بکریوں کو لینا طے کر کے علاج کے لیے چلے۔",
            "ایک صحابی نے کچھ پڑھا اور اس پر دم کیا تو وہ صحت مند ہو گیا صحابہ نے پوچھا کہ اپ نے کیا پڑھا تھا۔ جس پر انہوں نے کہا کہ میں نے سورۃ فاتحہ کی پڑھی تھی۔ یہ صحابی حضرت سعید خدری رضی اللہ تعالی عنہ تھے۔",
            "تو حسب وعدہ گاؤں والوں نے بکریاں اور دودھ صحابہ کو پیش کیا۔",
                        "صحابہ کرام نے ان کو تقسیم کرنے سے پہلے نبی کریم صلی اللہ علیہ وسلم سے اس کی شرعی حیثیت پوچھنے پر اتفاق کیا۔",
            "اپ صلی اللہ علیہ وسلم کے پاس حاضر ہو کر انہوں نے تمام ماجرہ بیان کیا تو اپ نے اس کی اجازت دی بلکہ فرمایا کہ اس میں میرا حصہ بھی لگاؤ۔"
          ],
          "notes": []
        }     ]
    },
    {
      "id": "surah-fatiha-summary",
      "title": "سورة الفاتحہ مختصر خلاصہ",
      "subtitle": "Summary of Surah Al-Fatiha",
      "icon": "BookOpen",
      "order": 2,
      "sections": [
        
        {
          "id": "themes-of-surah",
          "title": "سورۃ فاتحہ کے مضامین",
          "subtitle": "Themes of Surah Al-Fatiha",
          "content": [
            "اس کی پہلی چار ایات میں اللہ تعالی کی تعریف, حمد و ثنا, قیامت کے دن کی اس کی مکمل حاکمیت اور بادشاہی اور اسی کی عبادت اور اسی ہی سے مدد مانگنے کا اقرار ہے۔",
            "لہذا نماز میں سورۃ فاتحہ کی قرات کرتے وقت بھی ہمیں پوری یکسوئی اور خشوع و خضوع سے ان الفاظ کے ترجمے پر غور کرنا چاہیے کہ اللہ تعالی ہماری التجا سن رہا ہے اور حدیث مبارکہ کے مطابق گویا ہم اللہ تعالی کو دیکھ رہے ہیں نہیں تو وہ تو ہمیں دیکھ ہی رہا ہے۔"
          ],
          "notes": []
        },
        {
          "id": "dua-and-guidance",
          "title": "ہدایت کی دعا",
          "subtitle": "Prayer for Guidance",
          "content": [
            "اس کے بعد بندہ اللہ تعالی سے التجا کرتا ہے کہ وہ اسے اپنی خوشنودی والے راستے پر چلائے۔",
            "یہ خوشنودی حاصل کرنے والے وہ ہیں جنہوں نے اللہ اور اسکے رسول کی اتباع کی اور اپنی زندگیوں میں اللہ کے راستے میں اپنی جان اور مال سے جہاد کیا۔",
            "اسی سورت کے اگلے حصے میں ان لوگوں سے اللہ کی پناہ مانگی گئی جن پر اللہ کا غضب ہوا اور وہ جو گمراہ ہوئے۔"
          ],
          "notes": []
        }
      ]
    }
  ]
}
