{
  "meta": {
    "title": "آؤ جنت کی سیر کریں",
    "subtitle": "A Complete Guide to Jannah According to Quran and Hadith",
    "description": "تفصیل کے ساتھ جنت کی خصوصیات، دروازے، نہریں، حوریں اور جنتیوں کی زندگی، قرآن اور صحیح احادیث کی روشنی میں"
  },
  "chapters": [
    {
      "id": "introduction",
      "title": "تعارف",
      "subtitle": "Introduction",
      "icon": "BookOpen",
      "order": 1,
      "sections": [
        {
          "id": "purpose",
          "title": "تحریر کا مقصد",
          "subtitle": "Purpose of this Text",
          "content": [
            "ہماری اس تحریر کا مقصد اہل ایمان میں جنت کی طلب اور اس کے حصول کے لیے صالح اعمال کرنے کی کوشش کرنا ہے۔",
            "جیسا کہ ہم دنیا کے فائدوں کے لیے جس کو ہماری عقل کامیابی سمجھتی ھے اور اس کے حصول کے لیے ہم دن رات محنت کرتے ہیں اور اعلی سے اعلی مقام کے حصول کے لیے کوشاں رہتے ہیں۔",
            "اصل کامیابی آخرت کی کامیابی ہے جس کے بارے میں قرآن مجید میں بار بار غور و فکر کرنے کا حکم دیا گیا ہے۔",
            "قرآن مجید میں ارشاد ہے: 'رغبت کرنے والوں کو رغبت کرنی چاہیے۔' (سورة المطففين - آية 26)"
          ],
          "notes": []
        },
        {
          "id": "adam-in-jannah",
          "title": "حضرت آدم اور جنت",
          "subtitle": "Creation of Adam and the Fall",
          "content": [
            "اللہ تعالی نے حضرت آدم کو پیدا فرمایا اور انہیں اپنی زوجہ کے ساتھ جنت میں رہنے کا حکم دیا۔",
            "شیطان کے بہکانے سے انہوں نے اس درخت کا پھل چکھ لیا جس سے منع کیا گیا تھا۔",
            "اللہ تعالی نے انہیں جنت سے نکل جانے کا حکم دیا اور فرمایا تمہارے پاس میری ہدایت آئے گی تو جو کوئی اس کی پیروی کرے گا اسے نہ کوئی خوف ہوگا نہ غم۔",
            "دوسری جگہ فرمایا جو ایمان لائے اور نیک کام کیے اللہ تعالی ان کو جنتوں میں داخل کرے گا جن کے نیچے نہریں بہہ رہی ہیں اور وہ اس میں ہمیشہ رہیں گے۔"
          ],
          "notes": []
        }
      ]
    },
    {
      "id": "preparation-and-invitation",
      "title": "جنت کی تیاری اور دعوت",
      "subtitle": "Preparation and Invitation to Jannah",
      "icon": "BookOpen",
      "order": 2,
      "sections": [
        {
          "id": "metaphor-of-sardar",
          "title": "سردار کی مثال",
          "subtitle": "The Example of a Leader",
          "content": [
            "نبی کریم صلی اللہ علیہ والہ وسلم نے فرمایا میری ساری امت جنت میں جائے گی مگر جس نے انکار کیا۔",
            "صحابہ نے تعجب سے پوچھا جنت میں جانے سے کون انکار کرے گا تو آپ نے فرمایا جس نے میرے طریقے سے انکار کیا اس نے جنت میں جانے سے انکار کیا۔",
            "ایک سردار نے بہت بڑا محل بنایا اور ایک داعی کے ذریعے لوگوں کو دعوت دی۔ جس نے دعوت قبول کی اسے لطف ملا، جو نہ قبول کیا وہ محروم رہا۔",
            "یہ سردار اللہ تعالی، داعی ہمارے نبی کریم صلی اللہ علیہ والہ وسلم اور دسترخوان جنت کی علامت ہیں۔"
          ],
          "notes": []
        }
      ]
    },
    {
      "id": "gates-of-jannah",
      "title": "جنت کے دروازے",
      "subtitle": "Gates of Jannah",
      "icon": "DoorOpen",
      "order": 3,
      "sections": [
        {
          "id": "gates",
          "title": "دروازے",
          "subtitle": "Names of Gates",
          "content": [
            "صحیح احادیث کی روشنی میں جنت کے درج ذیل دروازے ہیں:",
            "باب الصلاۃ, باب الریان, باب الجہاد, باب صدقہ, باب الحج, باب ایمن, باب ذکر, باب القاظمین",
            "ان دروازوں سے جنتیوں کو ان کے اعمال کے اعتبار سے بلایا جائے گا۔ بعض خوش نصیبوں کو ہر دروازے سے آواز دی جائے گی، جیسے حضرت ابوبکر صدیق رضی اللہ تعالی عنہ کے بارے نبی کریم صلی اللہ علیہ وسلم نے فرمایا کہ تمہیں ہر دروازے سے پکارا جائے گا۔",
            "وضو کے بعد کلمہ شہادت پڑھنے والوں کو بھی خوشخبری دی جائے گی۔"
          ],
          "notes": []
        }
      ]
    },
    {
      "id": "levels-and-rivers",
      "title": "جنت کے درجات اور نہریں",
      "subtitle": "Levels and Rivers of Jannah",
      "icon": "MapPin",
      "order": 4,
      "sections": [
        {
          "id": "levels",
          "title": "جنت کے درجات",
          "subtitle": "Levels of Paradise",
          "content": [
            "حضرت عبادہ بن صامت کہتے ہیں نبی کریم صلی اللہ علیہ وسلم نے فرمایا جنت کے سو درجے ہیں اور ہر دو درجوں کے درمیان زمین و آسمان جتنا فاصلہ ہے۔",
            "سب سے اعلی جنت الفردوس ہے جس کے اوپر عرش الہی ہے۔",
            "ہمیشہ اللہ تعالی سے جنت الفردوس مانگو۔"],
          "notes": ["ممکن ہے اس میں س درجوں سے مراد خاص عدد ہو یا اس سے کثیر درجات میں صرف ان س کا بیان مقصود ہو۔", "نبی کریم صلی اللہ علیہ وسلم جنت کا دروازہ کھٹکھٹائیں گے تو اس کا پہرے دار ( خازن ) پوچھے گا کون ہے تو آپ جواب دیں گے محمد صلی اللہ علیہ وسلم ۔وہ کہے گا ہاں مجھے حکم ہے کہ اپ سے پہلے کسی کے لیے دروازہ نہ کھولوں۔ (صحیح مسلم 197)", "آپ صلی اللہ علیہ وسلم نے فرمایا جنت میں وہ نعمتیں ہیں جنہیں نہ کسی انکھ نے دیکھا نہ کان نے سنا اور نہ ہی کسی انسان کے دل میں اس کا خیال گزرا۔ (صحیح بخاری 4779)"]
        },
        {
          "id": "rivers",
          "title": "جنت کی نہریں",
          "subtitle": "Rivers of Paradise",
          "content": [
            "فردوس سے بہشت کی چار نہریں نکلتی ہیں: پانی کی نہر، دودھ کی نہر، شہد کی نہر، اور شراب کی نہر۔",
            "ان کا ذکر سورہ محمد میں آیا ہے کہ پانی کی نہریں کبھی بدبو پیدا نہیں کریں گی، دودھ کا ذائقہ کبھی نہیں بدلے گا، اور شراب پینے والوں کے لیے سراسر لذت ہوگی۔",
            "ہر قسم کے پھل اور میوہ جات جنتیوں کے لیے موجود ہوں گے۔"
          ],
          "notes": []
        }
      ]
    },
    {
      "id": "first-group-and-entry",
      "title": "جنت میں داخلہ اور پہلا گروہ",
      "subtitle": "Entry and First Group of Jannah",
      "icon": "Star",
      "order": 5,
      "sections": [
        {
          "id": "first-group",
          "title": "پہلا گروہ",
          "subtitle": "The First Group Entering Jannah",
          "content": [
            "یہ گروہ بغیر حساب جنت میں داخل ہوگا جو 70 ہزار اور ایک کے ساتھ مزید 70 ہزار ہوں گے۔",
            "ان کے چہرے چودھویں رات کے چاند کی طرح روشن ہوں گے۔",
            "اہل جنت نہ تھوکیں گے نہ ناک سینکیں گے نہ پیشاب پاخانے کی حاجت ہوگی۔",
            "ان کے برتن اور کنگیاں سونے اور چاندی کے ہوں گے، انگیٹھیوں میں عود معطر ہوگا، پسینہ کستوری ہوگا، ہر ایک کے لیے دو بیویاں ہوں گی، اور فرط حسن سے پنڈلیوں کا گوشت دکھائی دے گا۔"
          ],
          "notes": []
        },
        {
          "id": "group-following",
          "title": "بعد کا گروہ",
          "subtitle": "Following Groups",
          "content": [
            "اس کے بعد جانے والا گروہ اسمان میں سب سے زیادہ چمکتے ستارے کی طرح روشن چہرے رکھے گا۔",
            "کوئی بھی جنتی بیوی سے محروم نہیں ہوگا، نہ اختلاف ہوگا، نہ حسد یا بغض ہوگا، اور صبح و شام اللہ کی تسبیح بیان کریں گے۔",
            "جنتیوں کے دل پرندوں کی طرح ہوں گے۔ (صحیح مسلم 7162)"
          ],
          "notes": []
        }
      ]
    },
    {
      "id": "lifestyle-in-jannah",
      "title": "جنت میں زندگی",
      "subtitle": "Lifestyle in Jannah",
      "icon": "Home",
      "order": 6,
      "sections": [
        {
          "id": "age-and-appearance",
          "title": "عمر اور قد کاٹھ",
          "subtitle": "Age and Stature",
          "content": [
            "جنتیوں کی عمر 33 سال ہوگی اور ہمیشہ اسی عمر میں رہیں گے، رنگ صاف ہوگا، نہ داڑھی اور نہ بال ہوں گے۔",
            "اپنے والد حضرت آدم کی قدوقامت 60 ہاتھ میں ہوگی۔ (صحیح مسلم 7148)",
            "جنتی کا لباس ریشم کا ہوگا اور ہاتھ میں سونے کے کنگن ہوں گے۔",
            "نیک اولاد والدین کے ساتھ جنت میں ہوگی، اور والدین کے اجر میں کمی نہیں ہوگی۔"
          ],
          "notes": []
        },
        {
          "id": "palaces-and-trees",
          "title": "جنت کے محلات اور درخت",
          "subtitle": "Palaces and Trees",
          "content": [
            "جنت کے درخت کا سایہ اتنا وسیع ہوگا کہ ایک اونٹ سوار سو سال چلتا رہے تو بھی اس کا سایہ طے نہ کر سکے۔ (صحیح مسلم 7136)",
            "جنتیوں کا محل یا خیمہ سفید موتی کا بنا ہوگا، لمبائی 70 میل، گارا تیز کستوری پتھر، ہیرے اور موتی سے۔ (صحیح مسلم 7158, صحیح بخاری 7948)"
          ],
          "notes": []
        },
        {
          "id": "hoor-and-fruits",
          "title": "جنت کی حور اور پھل",
          "subtitle": "Hoor and Fruits",
          "content": [
            "جنت کی حور دنیاوی عورتوں کے مسائل سے پاک ہوگی۔",
            " اگر وہ اس دنیا میں جھانکے تو زمین اسمان روشن ہو جائے۔ تھوک سے پانی میٹھا ہو جائے۔ جی جنت کی نہروں پر بیٹھی نغمے گا رہی ہیں کہ ہمیں نیک اور بزرگ لوگوں کے لیے پیدا کیا گیا ہے۔جنتی اپنے بالا خانوں میں خوبصورت کلین اور سبز تکیوں پر بیٹھے ہوں گے اور جنت کی نعمتوں سے مستفید ہو رہے ہوں گے۔",
            "ہر طرح کے پھل، میوے اور گوشت جنتیوں کے لیے موجود ہوں گے۔",
            "\"اور وہاں (جنت میں) تمہارے لیے وہ سب کچھ ہوگا جو تمہارے جی چاہیں اور جو کچھ تم مانگو گے وہ تمہارے لیے وہاں موجود ہوگا۔\" (تفسیر ابن کثیر - سورۃ فصِّلت)"
          ],
          "notes": []
        }
      ]
    },
    {
      "id": "jannah-markets",
      "title": "جنتی بازار",
      "subtitle": "Jannah Markets",
      "icon": "ShoppingCart",
      "order": 7,
      "sections": [
        {
          "id": "jumma-bazaar",
          "title": "جمعہ بازار",
          "subtitle": "Friday Bazaar",
          "content": [
            "جنتیوں کا ہر جمعہ کو اجتماع ہوگا۔",
            "حضرت انس بن مالک رضی اللہ عنہ بیان کرتے ہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: جنت میں ایک بازار ہے جس میں جنتی ہر جمعہ کو آیا کریں گے، پھر شمال کی ہوا چلے گی جس سے ان کے چہرے اور کپڑے بھر جائیں گے اور ان کا حسن اور جمال بڑھ جائے گا۔ (صحیح مسلم 7146)",
            "جنتی اپنے اعمال کی فضیلت کے مطابق بازار میں داخل ہوں گے اور دنیاوی جمعہ کے دن کے برابر وقت میں اجازت دی جائے گی تاکہ اپنے رب کی زیارت سے مشرف ہوں۔"
          ],
          "notes": []
        }
      ]
    },
    {
      "id": "last-entry-and-season",
      "title": "آخری جنتی اور موسم",
      "subtitle": "Last Entry and Weather of Jannah",
      "icon": "Calendar",
      "order": 8,
      "sections": [
        {
          "id": "last-jannati",
          "title": "آخری جنتی",
          "subtitle": "The Last Person Entering Jannah",
          "content": [
            "جس شخص کو آخر میں جہنم سے نکال کر جنت بھیجا جائے گا اللہ تعالی فرمائیں گے کہ جنت میں چلے جاؤ۔",
            "وہ دیکھ کر جواب دے گا کہ اللہ تعالی وہاں تو کوئی جگہ نہیں ہے۔ اللہ تعالی اسے دوبارہ اور تیسرے مرتبہ بھی یہی کہیں گے۔",
            "اللہ تعالی فرمائیں گے کہ کیا میں تمہیں دنیا سے 10 گنا بڑی جنت دوں؟ وہ دیکھے گا کہ اسے دنیا سے دس گنا زیادہ بڑی جنت ملے گی۔"
          ],
          "notes": []
        },
        {
          "id": "jannah-weather",
          "title": "جنت کا موسم",
          "subtitle": "Weather of Paradise",
          "content": [
            "جنت کا موسم انتہائی معتدل ہوگا جیسے بہار میں سورج نکلنے سے پہلے کا موسم۔",
            "سورہ انسان آیت 13 میں اللہ تعالی فرماتے ہیں کہ وہ جنت میں نہ سوج کی تپش دیکھیں گے اور نہ کڑاکے کی سردی۔"
          ],
          "notes": []
        }
      ]
    },
    {
      "id": "duas",
      "title": "دعا",
      "subtitle": "Supplication",
      "icon": "Heart",
      "order": 9,
      "sections": [
        {
          "id": "final-dua",
          "title": "آخری دعا",
          "subtitle": "Final Supplication",
          "content": [
            "دعا ہے کہ اللہ تعالی ہمیں ان لوگوں میں شامل فرمائے جو بغیر حساب کتاب جنت الفردوس میں داخل کیے جائیں۔",
            "اس کے لیے دنیا میں اللہ اور رسول صلی اللہ علیہ وسلم کی کامل اطاعت نصیب فرمائے۔ آمین۔"
          ],
          "notes": []
        }
      ]
    }
  ]
}
